export const command = {
    name: 'المنيو',
    alias: ['منيو', 'menu', 'اوامر'],
    category: 'عام',
    async execute(sock, from, msg, args) {
        const publicMenu = `*─── ⌊ 𐙚 𝖹𝖤𝖭𝖨𝖭 𝖡𝖮𝖳 𐙚 ⌉ ───*

*🕋┇ قـسـم الإسـلامـيـات*
│ .قرآن  │ .اذكار  │ .حديث  │ .سورة

*🛡️┇ قـسـم الـحـمـايـة*
│ .احذف  │ .منع

*⚖️┇ قـسـم الإدارة*
│ .الادارة  │ .رفع_ادمن  │ .طرد

*📥┇ قـسـم الـتـحـمـيـلات*
│ .تيك  │ .يوت  │ .صورة  │ .صور

*🎮┇ قـسـم الـتـسـلـيـة*
│ .حظ  │ .صراحة  │ .لو_خيروك
│ .الالعاب  │ .فكك  │ .حزورة  │ .زواج

*⛩️┇ قـسـم الأنـمـي*
│ .انمي

*👤┇ قـسـم الـمـعـلـومـات*
│ .انا  │ .هو  │ .مطور  │ .ذكاء  │ .بنج

*🎨┇ قـسـم الأدوات*
│ .ملصق  │ .زخرف  │ .طقس  │ .حاسبة  │ .جودة

*─── ⌊ 𐙚 𝖯𝖮𝖶𝖤𝖱𝖤𝖣 𝖡𝖸 𝖣𝖠𝖱𝖪 ⌉ ───*`.trim();

        // اخترنا أهم 3 حاجات المستخدم بيحتاجها بسرعة
        const buttons = [
            { buttonId: '.الالعاب', buttonText: { displayText: '🕹️ الألعاب' }, type: 1 },
            { buttonId: '.ذكاء', buttonText: { displayText: '🤖 اسأل الذكاء' }, type: 1 },
            { buttonId: '.مطور', buttonText: { displayText: '👤 المطور' }, type: 1 }
        ];

        await sock.sendMessage(from, {
            image: { url: 'https://i.ibb.co/x8tBGJq7/6452932.jpg' },
            caption: publicMenu,
            footer: 'اضغط على الأزرار للوصول السريع ⚡',
            buttons: buttons,
            headerType: 4
        }, { quoted: msg });
    }
};

