export const command = {
    name: 'لو_خيروك',
    category: 'تسلية',
    async execute(sock, from, msg, args) {
        const choices = [
            'تعيش في الغابة 🌲 أو تعيش في الصحراء 🌵؟',
            'تمتلك القدرة على الطيران 🕊️ أو الاختفاء 👻؟',
            'تأكل بصل نيء 🧅 أو تأكل ليمون بقشره 🍋؟',
            'تكون غني وحيد 💰 أو تكون فقير مع أصدقائك 🫂؟'
        ];
        const randomC = choices[Math.floor(Math.random() * choices.length)];

        await sock.sendMessage(from, { 
            text: `*⚖️ لـعـبـة لـو خـيـروك*\n\n*الخيار:* ${randomC}` 
        });
    }
};

